---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceRoughness
source: html/205e92c3-8722-249b-f0a8-164c93860abb.htm
---
# Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceRoughness Property

The property labeled "Roughness" from the "AdvancedMetal" schema.

## Syntax (C#)
```csharp
public static string SurfaceRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.